<?php
$product->addRecord(params: [
    "name" => "ДРЕЛЬ АКК. EINHELL TC-CD 18-2 LI (1X1,5AH)",
    "description"=> "Дрель аккумуляторная Einhell TC-CD 18-2 Li – это мощный универсальный инструмент для сверления и завинчивания. Благодаря двухскоростному редуктору дрель является идеальным универсальным инструментом для работ в доме, мастерской и гараже. Эргономичная форма и мягкие вставки Softgrip на корпусе обеспечивают удобную работу. Дрель имеет автоматическую блокировку шпинделя для удобной замены оснастки в быстрозажимном 10 мм патроне. Яркая светодиодная подсветка освещает рабочую зону.",
    "price" => 4499,
    "path_image" => PROTOCOL."://".HOST.":".PORT."/media/drel.png"
]);
$product->addRecord(params: [
    "name" => "ВОЗДУХОДУВКА АКК EINHELL PXC GE-LB 36/210 LI E-SOLO",
    "description"=> "Воздуходувка аккумуляторная Einhell GE-LB 36/210 Li E-Solo - это мощный инструмент, который можно использовать в саду или на улице около дома. Благодаря электронной регулировке скорости вращения вентилятора мощность обдува можно легко регулировать. Для интенсивного обдува предусмотрен режим «Турбо». Регулировка длины трубы имеет три ступени, позволяя идеально подстроить устройство под рост пользователя. Бесщеточный двигатель имеет увеличенный срок службы и большую мощность. В комплект поставки входит удобный ремень для переноски. Аккумуляторы и зарядное устройство в комплект поставки не входят.",
    "price" => 8999,
    "path_image" => PROTOCOL."://".HOST.":".PORT."/media/vozdyhoduvka.png"
]);
$product->addRecord(params: [
    "name" => "ЛОБЗИК АККУМУЛЯТОРНЫЙ EINHELL PXC TC-JS 18 LI - SOLO",
    "description"=> "Лобзик Einhell универсален в использовании и предназначен для быстрого и точного пропила. Наличие аккумулятора позволяет работать лобзиком независимо от наличия источника питания электросети дома, в мастерской или гараже. Инструмент входит в линейку инструментов PXC и совместим со всеми аккумуляторами этой линейки. Благодаря высокой плавности хода аккумуляторный лобзик обеспечивает точные распилы, а для быстрого распила можно включить маятниковый ход. Замена пильных полотен осуществляется без вспомогательных инструментов благодаря универсальному держателю. Функция сдува пыли обеспечивает оптимальную видимость во время работы. Пластиковая скользящая вставка предотвращает повреждение заготовок, требующих бережного отношения. В комплект поставки входит качественное пильное полотно KWB для древесины. Поставляется без аккумулятора и зарядного устройства.",
    "price" => 4108,
    "path_image" => PROTOCOL."://".HOST.":".PORT."/media/lobzik.png"
]);
$product->addRecord(params: [
    "name" => "МИКСЕР АККУМУЛЯТОРНЫЙ EINHELL TE-MX 18 LI - SOLO",
    "description"=> "Миксер аккумуляторный Einhell TE-MX 18 Li-solo является представителем семейства Power X-Change. Электронная регулировка оборотов позволяет настроить инструмент под конкретный материал. Плавный пуск и ручка эргономичной формы с мягкими накладками Softgrip обеспечивают комфортную и безопасную работу. Прочный алюминиевый корпус редуктора и узел крепления оснастки (резьба М14) рассчитаны на долговечную работу. В комплект поставки входит насадка для смешивания диаметром 100 мм. Аккумулятор и зарядное устройство в комплект поставки не входят. Все аккумуляторы системы PXC совместимы с данным инструментом.",
    "price" => 7589,
    "path_image" => PROTOCOL."://".HOST.":".PORT."/media/mikser.jpg"
]);
$product->addRecord(params: [
    "name" => "КОЛОНКА БЕСПРОВОДНАЯ EINHELL PXC TC-SR 18 LI BT - SOLO",
    "description"=> "Аккумуляторная акустическая колонка TC-SR 18 Li BT-Solo от Einhell легко подключается ко всем устройствам с поддержкой Bluetooth, например смартфонам или планшетам. Кроме того, колонка оснащена разъемом AUX для подключения MP3-плееров или смартфонов через Jack 3.5, а также USB-разъемом для зарядки смартфона, планшета или MP3-плеера. Интуитивно понятная панель управления упрощает использование. Как представитель линейки инструментов Power-X-Change, колонка совместима со всеми аккумуляторами этой линейки. Поставляется без аккумулятора и зарядного устройства. Они продаются отдельно, например в виде практичного стартового набора.",
    "price" => 2799,
    "path_image" => PROTOCOL."://".HOST.":".PORT."/media/kolonka.png"
]);
$product->addRecord(params: [
    "name" => "ГАЗНОНКОСИЛКА АККУМУЛЯТОРНАЯ EINHELL GE-CM 18/33 LI (1X4,0AH)",
    "description"=> "Аккумуляторная газонокосилка Einhell GE-CM 18/33 Li (1x4,0 Ач) входит в семейство Power X-Change и рекомендуется для использования на газонах площадью 200 м². Газонокосилка оснащена колесами большого диаметра и приводится в движение бесщеточным электродвигателем Einhell. Кроме этого, в ней предусмотрена функция централизованной 5-позиционной регулировки высоты среза, длинная, складная и регулируемая по высоте ручка с 3 положениями, а также сборник срезанной травы, оснащенный индикатором уровня. Корпус газонокосилки изготовлен из высококачественной, ударопрочной пластмассы и снабжен встроенной ручкой для переноса. В комплект поставки входит аккумуляторная батарея 4,0 Ач со светодиодным индикатором уровня заряда, которая подходит для всех устройств данной серии, а также зарядное устройство.",
    "price" => 19999,
    "path_image" => PROTOCOL."://".HOST.":".PORT."/media/gazonokosilka.png"
]);